run/validationSuite/NACA4412-airfoil/noOverset/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
         solver            amgSolver;
         cycle             V-cycle;
         policy            PAMG;
         interpolation     direct;
         nPreSweeps        2;
         nPostSweeps       2;
         groupSize         4;
         minCoarseEqns     100;
         nMaxLevels        100;
         scale             on;
         smoother          GaussSeidel;

         minIter           1;
         maxIter           200;
         tolerance         1e-7;
         relTol            0.01;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0.01;
        minIter          1;
    }

    k
    {
        solver           BiCGStab;
        preconditioner   DILU; 
        tolerance        1e-08;
        relTol           0.1;
        minIter          1;
    }

	omega
    {
        solver           BiCGStab;
        preconditioner   DILU; 
        tolerance        1e-08;
        relTol           0.1;
        minIter          1;
    }
}

SIMPLE
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        U               0.7;
        k               0.5;
        epsilon         0.5;
    }
    fields
    {
        p               0.3;
    }
}

// ************************************************************************* //
